#include "sys.h"

volatile unsigned int data timer0_cnt = 0;
volatile int data sec_cnt;
void (code * pfun1)(void) = 0;	// 定时到达时操作函数的函数指针1

#define T0H 0xF8 
#define T0L	0xCD

/***************************初始化定时器0****************************/
/*函数原型:Timer0Init
/*函数功能:初始化定时器0
/*输入参数:无
/*输出参数:无
/********************************************************************/
void Timer0Init(void)
{

	TMOD=0x01;                      //设置定时器0为工作方式1
	//	AUXR|=T0x12;
	TH0=T0H;         								//放入初值,22.1184M,1ms
	TL0=T0L;

	// 设置定时器0中断优先级(优先级1)
	IPH &= ~0x02;
	PT0 = 1;

	EA=1;                           //开总中断
	ET0=1;                        	//开定时器0中断
  TR0=1;                          //启动定时器0
}

/***************************定时器0中断******************************/
/*函数原型:Timer0
/*函数功能:每1ms执行一次中断，中断内部重新赋值
/*输入参数:无
/*输出参数:无
/********************************************************************/
void timer0() interrupt 1
{
	TH0=T0H;
	TL0=T0L;
	timer0_cnt++;
	if(timer0_cnt == 1000)
	{
		timer0_cnt = 0;
		sec_cnt++;
	}
}

/***************************定时函数******************************/
/*函数原型:void DelaySec(unsigned char sec)
/*函数功能:等待一秒
/*输入参数:sec，要等待的时间（秒）
/*输出参数:无
/********************************************************************/
void DelaySec(unsigned char sec)
{
	sec_cnt = 0;
	while(sec_cnt < sec);		
}